//Урок 2 (Решение домашнего задания №2)
//
Функция РазностьДат(ДатаНач, ДатаДо) Экспорт
	
	КвоМес = 0;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(&ДатаНач, &ДатаДо, МЕСЯЦ) КАК ЧислоМесяц");
	
	ДатаНачКакДАТА = ?(ТипЗнч(ДатаНач)=Тип("Дата"),ДатаНач, 
		Дата(Лев(ДатаНач,4), Сред(ДатаНач, 5, 2), Прав(ДатаНач,2)));
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачКакДАТА);
	Запрос.УстановитьПараметр("ДатаДо", ДатаДо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		КвоМес = Выборка.ЧислоМесяц;
	КонецЕсли;	
	
	Возврат КвоМес;
КонецФункции	