
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Остатки Расход
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Остаток = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Движения.Записать();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПродажаТовары.Товар КАК Товар,
	|	СУММА(ПродажаТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтТаблица
	|ИЗ
	|	Документ.Продажа.Товары КАК ПродажаТовары
	|ГДЕ
	|	ПродажаТовары.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажаТовары.Товар
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиОстатки.Товар КАК Товар,
	|	ОстаткиОстатки.ОстатокОстаток КАК Остаток
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(
	|			,
	|			Товар В
	|				(ВЫБРАТЬ
	|					ВтТаблица.Товар КАК Товар
	|				ИЗ
	|					ВтТаблица КАК ВтТаблица)) КАК ОстаткиОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТаблица.Товар КАК Товар,
	|	ВтТаблица.Количество КАК Количество,
	|	ЕСТЬNULL(ВтОстатки.Остаток, 0) КАК Остаток
	|ИЗ
	|	ВтТаблица КАК ВтТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК ВтОстатки
	|		ПО ВтТаблица.Товар = ВтОстатки.Товар
	|ГДЕ
	|	ЕСТЬNULL(ВтОстатки.Остаток, 0) < 0");
	
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезЗапр = Запрос.Выполнить();
	Выборка = РезЗапр.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отказ = Истина;
		Сообщить("Недостаточно товара: " + Выборка.Товар);
		
	КонецЦикла;	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
