
&НаСервереБезКонтекста
Процедура СоздатьТоварыНаСервере()
	
	МассивТоваров = Новый Массив();
	МассивТоваров.Добавить("Спининг одноколенный");
	МассивТоваров.Добавить("Удочка любительская");
	МассивТоваров.Добавить("Садок для рыбы");
	МассивТоваров.Добавить("Казан для ухи");
	МассивТоваров.Добавить("Рыбацкий нож");
	МассивТоваров.Добавить("Стул со спинкой");
	МассивТоваров.Добавить("Леска универсальная");
	МассивТоваров.Добавить("Крючки универсальные");
	МассивТоваров.Добавить("Набор для спининга");
	МассивТоваров.Добавить("Набор для удочки");
	
	Для Каждого Товар Из МассивТоваров Цикл
		
		ТоварСсылка = Справочники.Товары.НайтиПоНаименованию(Товар);
		
		Если ЗначениеЗаполнено(ТоварСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйТовар = Справочники.Товары.СоздатьЭлемент();
		НовыйТовар.УстановитьНовыйКод();
		НовыйТовар.Наименование = Товар;
		НовыйТовар.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТовары(Команда)
	СоздатьТоварыНаСервере();
КонецПроцедуры
